<h1 style="
  font-family: Georgia, serif;
  font-size: 44px;
  text-align: center;
  color: #ef12d2;
  margin: 30px 0 10px 0;
">
Pandas Introduction
</h1>

<p style="
  text-align:center;
  font-size:16px;
  color:#6b7280;
">
Pandas is an open-source Python library used for data manipulation, analysis and cleaning. It provides fast and flexible tools to work with tabular data, similar to spreadsheets or SQL tables.
</p>

<div style="
  background: #f9fafb;
  border-radius: 12px;
  padding: 18px;
  box-shadow: 0 4px 10px rgba(0,0,0,0.08);
  margin: 20px 0;
">
  <h4 style="margin-top:0; color:#111827;">Pandas is used in data Science,ML,Finance</h4>
  <p style="margin-bottom:0; color:black">
    NumPy: numerical operations
    Matplotlib and Seaborn: data visualization
    SciPy: statistical analysis
    Scikit-learn: machine learning workflows
  </p>
</div>

Data Structures 
1.panda Series

2.Panda DataFrame

3.operations-Loading data,viewing and exploring data,
handling missing data,selecting and filtering data,adding and removing columns,grouping data

In [2]:
import pandas as pd
df=pd.DataFrame()
print(df)
lst=['Harshith','vinesh','rao','saritha','rani']
df=pd.DataFrame(lst)
print(df)

Empty DataFrame
Columns: []
Index: []
          0
0  Harshith
1    vinesh
2       rao
3   saritha
4      rani

In [3]:
import numpy as np
data=np.array([[1,2,3],[4,5,6],[7,8,9]])
df=pd.DataFrame(data,columns=['A','B','C'])
print(df)

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [4]:
#json resonses often contain lists of dictionaries
dict={'name':['Harshith','vinesh','rao','saritha','rani'],
        'degree':['btech','cse','2nd Year','Law','PG'],
        'score':[89,98,67,99,99]}
df=pd.DataFrame(dict)
print(df)

       name    degree  score
0  Harshith     btech     89
1    vinesh       cse     98
2       rao  2nd Year     67
3   saritha       Law     99
4      rani        PG     99

pandas.DataFrame(data, index, columns) 

Parameters: 

 data: It is a dataset from which a DataFrame is to be created. It can be a list, dictionary, scalar value, series, and arrays, etc. 

 index: It is optional, by default the index of the DataFrame starts from 0 and ends at the last data value(n-1). It defines the row label explicitly.
  
 columns: This parameter is used to provide column names in the DataFrame. If the column name is not defined by default, it will take a value from 0 to n-1. 
Returns:

DataFrame object

In [2]:
import pandas as pd
df=pd.read_csv("people_data.csv")
df

,First Name,Last Name,Sex,Email,Date of birth,Job Title
0,Shelby,Terrell,Male,elijah57@example.net,1945-10-26,Games developer
1,Phillip,Summers,Female,bethany14@example.com,1910-03-24,Phytotherapist
2,Kristine,Travis,Male,bthompson@example.com,1992-07-02,Homeopath
3,Yesenia,Martinez,Male,kaitlinkaiser@example.com,2017-08-03,Market researcher
4,Lori,Todd,Male,buchananmanuel@example.net,1938-12-01,Veterinary surgeon

<p style="font-family:Fantasy">
<code>read_csv()</code> function in pandas is used to read data from CSV files into a pandas Dataframe
</p>
<code>pd.read_csv(filepath_or_buffer, sep=' ,' , header='infer',  index_col=None, usecols=None, engine=None, skiprows=None, nrows=None)</code>
<p>filepath_or_buffer: Location of the csv file. It accepts any string path or URL of the file.
sep: It stands for separator, default is ', '.
header: It accepts int, a list of int, row numbers to use as the column names, and the start of the data. If no names are passed, i.e., header=None, then, it will display the first column as 0, the second as 1, and so on.
usecols: Retrieves only selected columns from the CSV file.
nrows: Number of rows to be displayed from the dataset.
index_col: If None, there are no index numbers displayed along with records.  
skiprows: Skips passed rows in the new data frame.</p>

<h2 style="font-family:Cursive">Features</h2>

In [3]:
#read specific columns using read_csv
df=pd.read_csv("people_data.csv",usecols=["First Name","Email"])
print(df)

  First Name                       Email
0     Shelby        elijah57@example.net
1    Phillip       bethany14@example.com
2   Kristine       bthompson@example.com
3    Yesenia   kaitlinkaiser@example.com
4       Lori  buchananmanuel@example.net

In [4]:
#setting an index column
df=pd.read_csv("people_data.csv",index_col="First Name")
print(df)

           Last Name     Sex                       Email Date of birth  \
First Name
Shelby       Terrell    Male        elijah57@example.net    1945-10-26
Phillip      Summers  Female       bethany14@example.com    1910-03-24
Kristine      Travis    Male       bthompson@example.com    1992-07-02
Yesenia     Martinez    Male   kaitlinkaiser@example.com    2017-08-03
Lori            Todd    Male  buchananmanuel@example.net    1938-12-01

                     Job Title
First Name
Shelby         Games developer
Phillip         Phytotherapist
Kristine             Homeopath
Yesenia      Market researcher
Lori        Veterinary surgeon

In [6]:
# handling missing values 
df = pd.read_csv("people_data.csv", na_values=["N/A", "Unknown"])
df

,First Name,Last Name,Sex,Email,Date of birth,Job Title
0,Shelby,Terrell,Male,elijah57@example.net,1945-10-26,Games developer
1,Phillip,Summers,Female,bethany14@example.com,1910-03-24,Phytotherapist
2,Kristine,Travis,Male,bthompson@example.com,1992-07-02,Homeopath
3,Yesenia,Martinez,Male,kaitlinkaiser@example.com,2017-08-03,Market researcher
4,Lori,Todd,Male,buchananmanuel@example.net,1938-12-01,Veterinary surgeon

In [7]:
# reading csv files with different delimiters
data="""totalbill_tip, sex:smoker, day_time, size
16.99, 1.01:Female|No, Sun, Dinner, 2
10.34, 1.66, Male, No|Sun:Dinner, 3
21.01:3.5_Male, No:Sun, Dinner, 3
23.68, 3.31, Male|No, Sun_Dinner, 2
24.59:3.61, Female_No, Sun, Dinner, 4
25.29, 4.71|Male, No:Sun, Dinner, 4"""
with open("people_data.csv","w") as file:
    file.write(data)
print(data)

totalbill_tip, sex:smoker, day_time, size
16.99, 1.01:Female|No, Sun, Dinner, 2
10.34, 1.66, Male, No|Sun:Dinner, 3
21.01:3.5_Male, No:Sun, Dinner, 3
23.68, 3.31, Male|No, Sun_Dinner, 2
24.59:3.61, Female_No, Sun, Dinner, 4
25.29, 4.71|Male, No:Sun, Dinner, 4

In [8]:
df=pd.read_csv('people_data.csv',sep='[:,|_]',#define the delimiters
               engine='python')
df

   totalbill   tip      sex smoker   day     time   size
0      16.99  1.01   Female     No   Sun   Dinner      2
1      10.34  1.66     Male     No   Sun   Dinner      3
2      21.01  3.50     Male     No   Sun   Dinner      3
3      23.68  3.31     Male     No   Sun   Dinner      2
4      24.59  3.61   Female     No   Sun   Dinner      4
5      25.29  4.71     Male     No   Sun   Dinner      4

In [10]:
df = pd.read_csv('people_data.csv', nrows=3)
df

                  totalbill_tip  sex:smoker        day_time   size
16.99            1.01:Female|No         Sun          Dinner    2.0
10.34                      1.66        Male   No|Sun:Dinner    3.0
21.01:3.5_Male           No:Sun      Dinner               3    NaN

In [11]:
df=pd.read_csv("people_data.csv")
print("Previous data:\n",df)
df=pd.read_csv("people_data.csv",skiprows=[4,5])
print("after:\n",df)

Previous data:
                   totalbill_tip  sex:smoker        day_time   size
16.99            1.01:Female|No         Sun          Dinner    2.0
10.34                      1.66        Male   No|Sun:Dinner    3.0
21.01:3.5_Male           No:Sun      Dinner               3    NaN
23.68                      3.31     Male|No      Sun_Dinner    2.0
24.59:3.61            Female_No         Sun          Dinner    4.0
25.29                 4.71|Male      No:Sun          Dinner    4.0
after:
                   totalbill_tip  sex:smoker        day_time   size
16.99            1.01:Female|No         Sun          Dinner    2.0
10.34                      1.66        Male   No|Sun:Dinner    3.0
21.01:3.5_Male           No:Sun      Dinner               3    NaN
25.29                 4.71|Male      No:Sun          Dinner    4.0

In [12]:
url = "https://media.geeksforgeeks.org/wp-content/uploads/20241121154629307916/people_data.csv"
df = pd.read_csv(url)
df

,First Name,Last Name,Sex,Email,Date of birth,Job Title
0,Shelby,Terrell,Male,elijah57@example.net,1945-10-26,Games developer
1,Phillip,Summers,Female,bethany14@example.com,1910-03-24,Phytotherapist
2,Kristine,Travis,Male,bthompson@example.com,1992-07-02,Homeopath
3,Yesenia,Martinez,Male,kaitlinkaiser@example.com,2017-08-03,Market researcher
4,Lori,Todd,Male,buchananmanuel@example.net,1938-12-01,Veterinary surgeon